In [1]:
import pandas as pd
import pyodbc

# Import CSV
data = pd.read_csv(r'E:\OneDrive - Quadratic Insights Pvt Ltd\Desktop\Lab_result\Procedure_Data_Analysis - Copy.csv')   
df = pd.DataFrame(data)

# Connect to SQL Server
conn = pyodbc.connect("Driver={ODBC Driver 17 for SQL Server};"
                     "Server=172.16.1.35,1433;"
                     "Database=Epic_Test;"
                     "UID=ssrampur;"
                     "PWD=SsrQtx@#2022;")
cursor = conn.cursor()

In [2]:
#cursor.execute("""DROP TABLE GenSvcInfo1""")
df

       Service_ID  Service_Fee Daignosis_Code Procedure_Code
0             468          0.0     E11.9               3074F
1             469          0.0     E11.9               3078F
2             467        160.0     E11.9               99214
3             595         20.0     E11.65              83036
4             596          8.0     E11.65              36416
...           ...          ...            ...            ...
59859     3440442         10.0     E11.69              81002
59860     3440443          6.5     E11.69              82962
59861     3440447        306.8     E11.9               99204
59862     3440448          0.0     E11.9               3074F
59863     3440449          0.0     E11.9               3078F

[59864 rows x 4 columns]

In [3]:
# Create Table
cursor.execute('''
CREATE TABLE data_Analysis(
Service_ID int,
Service_Fee float,
Daignosis_Code varchar(10),
Procedure_Code varchar(10)
)
               ''')

In [58]:
# conn.commit()

In [4]:
df.dtypes

Service_ID          int64
Service_Fee       float64
Daignosis_Code     object
Procedure_Code     object
dtype: object

In [5]:
#df['Appointment_Date'] = pd.to_datetime(df['Appointment_Date'],format='%Y-%m-%d',errors='coerce')
#df['Service_Date_To'] = pd.to_datetime(df['Service_Date_To'],format='%Y-%m-%d',errors='coerce')
#df['Patient_Sex'] = df['Patient_Sex'].astype("string")
df['Daignosis_Code'] = df['Daignosis_Code'].astype("string")
df['Procedure_Code'] = df['Procedure_Code'].astype("string")

In [61]:
# df['Appointment_Date']=lambda x : pd.to_datetime(x["Appointment_Date"], errors="coerce").dt.date
# df['Service_Date_To']=lambda x : pd.to_datetime(x["Service_Date_To"], errors="coerce").dt.date

In [62]:
#df['Appointment_Date'] = pd.to_datetime(df['Appointment_Date']).dt.normalize()

In [6]:
df.dtypes

Service_ID          int64
Service_Fee       float64
Daignosis_Code     string
Procedure_Code     string
dtype: object

In [7]:
df.head()

   Service_ID  Service_Fee Daignosis_Code Procedure_Code
0         468          0.0     E11.9               3074F
1         469          0.0     E11.9               3078F
2         467        160.0     E11.9               99214
3         595         20.0     E11.65              83036
4         596          8.0     E11.65              36416

In [8]:
# Insert DataFrame to Table
for row in df.itertuples():
    cursor.execute('''INSERT INTO data_Analysis(Service_ID,Service_Fee,Daignosis_Code,Procedure_Code)
                VALUES (?,?,?,?)
                ''',
                row.Service_ID, 
                row.Service_Fee,
                row.Daignosis_Code,
                row.Procedure_Code,
               )
                
                
                   
conn.commit()